
&НаКлиенте
Процедура ПереченьНоменклатурыНоменклатураПриИзменении(Элемент)
	ТД = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	ТД.Цена = РаботаСоСправочникамиВызовСервера.РозничнаяЦена(Объект.Дата, ТД.Номенклатура);
	РаботаСДокументамиКлиент.РасчетТЧ(ТД);
КонецПроцедуры


&НаКлиенте
Процедура ПереченьНоменклатурыКоличествоПриИзменении(Элемент)
	ТД = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументамиКлиент.РасчетТЧ(ТД);
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыЦенаПриИзменении(Элемент)
	ТД = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументамиКлиент.РасчетТЧ(ТД);
КонецПроцедуры
